applications/Bioconversion/models/EH_OpenFOAM/tests/BoxReact/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \\    /   O peration     | Website:  https://openfoam.org
  \\  /    A nd           | Version:  dev
  \\/     M anipulation  |
  \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
   (0 0 0)
   (1 0 0)
   (1 1 0)
   (0 1 0)
   (0 0 1)
   (1 0 1)
   (1 1 1)
   (0 1 1)
);

blocks
(
 //block 0
 hex (0  1   2   3    4    5    6    7) (1 1 1) simpleGrading (1 1 1)
);

boundary
(
);

mergePatchPairs
(
);

// ************************************************************************* //
