applications/Bioconversion/models/EH_OpenFOAM/tests/BoxReact/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(phis|phifs|phirs|phils|ceb|cef|cg|cx|cl)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(phis|phifs|phirs|phils|ceb|cef|cg|cx|cl)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors 1;
    nCorrectors       3;
    nNonOrthogonalCorrectors 0;
    pRefCell          0;
    pRefValue         0;
}

relaxationFactors
{
    equations
    {
        ".*"   1.0;
    }
}


// ************************************************************************* //
